
export const MAIN_CATEGORIES = ['قطع غيار', 'كماليات', 'زيوت وشحومات', 'بطاريات', 'إطارات'];

export const SUB_CATEGORIES: { [key: string]: string[] } = {
    'قطع غيار': ['فلاتر', 'سيور', 'بوجيهات', 'تيل فرامل', 'مساعدين', 'بطاحات'],
    'كماليات': ['دواسات', 'معطرات', 'اكسسوارات'],
    'زيوت وشحومات': ['زيت محرك', 'زيت فتيس', 'شحم'],
    'بطاريات': ['بطاريات سائلة', 'بطاريات جافة'],
    'إطارات': ['إطارات صيفي', 'إطارات شتوي'],
};

export const BRANDS = ['Bosch', 'Mann-Filter', 'NGK', 'Brembo', 'Sachs', 'Lemförder', 'Total', 'Mobil', 'Varta', 'Hankook'];
